# ScheduleEmbeddedParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ScheduleEmbeddedParam Property
ParameterTypeId Class See Also
---
"Embedded Schedule"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ScheduleEmbeddedParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ScheduleEmbeddedParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ScheduleEmbeddedParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace